[{"model": "blog.post", "pk": 1, "fields": {"author": 1, "title": "Maratha Military Landscapes of India inscribed in UNESCO’s World Heritage list", "text": "Maratha Military Landscapes of India has been inscribed on the UNESCO World Heritage List, becoming India’s 44th property to receive this recognition.\r\n\r\nThis global accolade celebrates India’s enduring cultural legacy, showcasing its diverse traditions of architectural brilliance, regional identity, and historical continuity.\r\n\r\nPrime Minister Narendra Modi, Minister of Culture Gajendra Singh Shekhawat and Chief Minister of Maharashtra Devendra Fadnavis lauded the historic milestone and congratulated the people of India for this achievement. This decision was taken at the 47th Session of the World Heritage Committee.\r\n\r\nSpanning from the 17th to 19th centuries CE, Maratha Military Landscapes of India is an extraordinary network of twelve forts that demonstrates the strategic military vision and architectural ingenuity of the Maratha Empire.\r\n\r\nSpread across the states of Maharashtra and Tamil Nadu, the selected sites, include Salher, Shivneri, Lohgad, Khanderi, Raigad, Rajgad, Pratapgad, Suvarnadurg, Panhala, Vijaydurg, and Sindhudurg in Maharashtra, along with Gingee Fort inTamil Nadu.\r\n\r\nThe proposal was sent to the consideration of World Heritage Committee in January 2024 and after a rigorous eighteen-month long process involving several technical meetings with the advisory bodies and visit of International Council on Monuments and Sites mission to review the sites, this historic decision was taken by the members of the World Heritage Committee last evening at UNESCO Headquarters, Paris.\r\n\r\nPrime Minister Narendra Modi has lauded the inclusion of the Maratha Military Landscapes in the prestigious UNESCO World Heritage List. In a social media post, Mr Modi said that every Indian is elated with this recognition.\r\n\r\nHe said that these Maratha Military Landscapes include twelve majestic forts, eleven of which are in Maharashtra and one is in Tamil Nadu.\r\n\r\nHe said that the Maratha Empire is associated with good governance, military strength, cultural pride and social welfare. Prime Minister added that the great rulers inspire the countrymen with their refusal to bow to any injustice.\r\n\r\nMr Modi also urged citizens to visit these forts and learn about the rich history of the Maratha Empire.", "created_date": "2025-07-13T06:45:58Z", "published_date": "2025-07-13T08:30:00Z"}}, {"model": "blog.post", "pk": 2, "fields": {"author": 1, "title": "New discovery reveals Mars once had a river system mightier than the Ganga", "text": "Traditionally, Mars was thought to have been cold and dry, with only brief periods of melting ice creating short-lived rivers.\r\n\r\nIn a discovery that could transform our understanding of Mars, scientists have mapped more than 15,000 kilometers of ancient riverbeds in the planet’s southern highlands, revealing that the Red Planet may once have been far wetter and more Earth-like than previously believed.\r\n\r\nThe newly identified Martian river system, stretching over 15,000 kilometers, surpasses the length of India’s Ganga river system and rivals some of the largest on Earth.\r\n\r\nThese ancient channels, known as fluvial sinuous ridges or inverted channels, were found across Noachis Terra, a vast, relatively underexplored region of Mars.\r\n\r\nThe ridges are believed to have formed when sediments deposited by flowing rivers hardened over time and were later exposed as softer surrounding material eroded away.", "created_date": "2025-07-13T12:30:00Z", "published_date": "2025-07-13T18:30:00Z"}}, {"model": "blog.post", "pk": 3, "fields": {"author": 1, "title": "Tesla: What we know about Musk's first EV showroom in India", "text": "Elon Musk's Tesla opened its first-ever showroom in Los Angeles, US, in 2008.\r\n\r\nSince then, it has expanded to multiple cities the America and overseas too; it has set up close to 400 retail outlets worldwide, including Europe, Asia Pacific, spread over 35 countries. Now, more than one and a half decades later, it is finally coming to India later this month. It is scheduled to open the doors of the store on July 15.\r\n\r\nTesla: Key things to know about Musk's first EV showroom in India:\r\n\r\n1) Tesla's first-ever India showroom is coming up at Mumbai's posh locality-- Bandra Kurla Complex (BKC)'s Maker Maxity, very close to Apple's first physical store in India.\r\n\r\n2) Tesla is said to have leased around 4,000 square feet of space. It will be an experience centre, and customers will get a first-hand feel of the car. Media reports have indicated that the company is expected to take orders and probably be able to deliver cars in August or later this year. \r\n\r\n3) It should be noted that Tesla cars, which will be imported from the US or China, will be levied with 70 per cent duty and other taxes.\r\n\r\n4) After import duty tax, the base Model Y, which is said to cost $31,998 (roughly Rs 27.7 lakh), will be offered for Rs 50-55 lakhs. Local taxes such as GS, road tax, registration and insurance will push the price beyond Rs 60 lakhs.\r\n\r\n5) Elon Musk's company is also planning to set up a second Tesla showroom in Delhi.\r\n\r\n Tesla has no immediate plans to set up assembly plants in India as such. So, the prices of the cars will remain exorbitantly high compared to local EVs.", "created_date": "2025-07-14T12:30:00Z", "published_date": "2025-07-15T12:30:00Z"}}, {"model": "blog.post", "pk": 4, "fields": {"author": 1, "title": "Enrolment in third phase clinical trials for India’s first dengue vaccine nearly complete, says ICMR", "text": "There is currently no antiviral treatment or licensed vaccine for dengue in India, which ranks among the top 30 countries with the highest incidence of the disease.\r\n\r\nFollowing an announcement by the Indian Council of Medical Research (ICMR) and Panacea Biotec Limited to initiate third phase trials, about 8,000 of the targeted 10,000 participants have enrolled in the third phase of clinical trials for a dengue vaccine in India.\r\n\r\nThe trial will be rolled out at 20 centres across the country, Dr. Murhekar said. “In India, all four serotypes of the dengue virus are known to circulate or co-circulate in many regions, so it’s vital to ensure that we have an effective vaccine that achieves good efficacy for all four serotypes,’’ he added.\r\n\r\nThe trial is primarily funded by ICMR, with partial support from Panacea Biotec. Participants will be followed up for two years under projects spread across various centres, including Chennai, Pune, Hyderabad, and Delhi.\r\n\r\nThere is currently no antiviral treatment or licensed vaccine for dengue in India.\r\n\r\n“This landmark trial will evaluate the efficacy of India’s indigenous tetravalent dengue vaccine, DengiAll, developed by Panacea Biotec. The first participant in this trial was vaccinated last year at Pandit Bhagwat Dayal Sharma Post Graduate Institute of Medical Sciences, Rohtak,’’ a release issued by the Union Health Ministry said.\r\n\r\nThe tetravalent dengue vaccine strain (TV003/TV005) originally developed by the National Institutes of Health, the U.S., has shown promising results in preclinical and clinical trials worldwide. Panacea Biotec, one of three Indian companies to receive the strain, is at the most advanced stage of developing a vaccine. The company has worked extensively on these strains to develop a full-fledged vaccine formulation and holds a process patent for this work. The first and second phases of the clinical trials of Indian vaccine formulations were completed in 2018-19, yielding promising results.", "created_date": "2025-07-15T06:53:28Z", "published_date": null}}, {"model": "blog.post", "pk": 5, "fields": {"author": 1, "title": "Tech wrap this week: Samsung's Galaxy Z Fold 7, Flip 7 models, Vivo T4R and more", "text": "Samsung's Galaxy Z Fold 7, Flip 7 models, and Watch 8 range brought a significant boost to wearables and foldables by incorporating state-of-the-art AI. This week's launches mark a technological revolution characterised by physical-digital fusion, AI integration, and system-scale orchestration across industries.\r\n\r\nHere are the key highlights of major tech announcements and launches from July 4 to July 11, 2025.\r\n\r\nInfinix Hot 60 5G+\r\n\r\nInfinix Hot 60 5G+ was launched in India on July 11 in three colours, Shadow Blue, Tundra Green and Sleek Black. It has a sleek 7.8 mm body, up to 12 GB RAM, supports a 5,200 mAh battery with 18 W fast charging and offers a smooth gaming experience. The price starts at ₹ 10,499 for the 6GB + 128GB variant.\r\n\r\nSamsung Galaxy Z Fold 7\r\n\r\nSamsung has launched the slimmest and lightest Fold 7, weighing just 8.9 mm. It has an 8-inch full HD+ display, 11% larger than that of the Fold 6. It offers a RAM of up to 1 TB and supports 4,400 mAh with 25 W fast wireless charging. It also comes with a triple camera setup. The 12GB + 256GB variant is priced at ₹ 1,74,999.\r\n\r\nAcer Iconia Tab iM11\r\n\r\nAcer has launched the Iconia Tab iM11 Android tablet, powered by the MediaTek Helio G99 processor. It has an 11.45-inch IPS display and comes with a stereo quad speaker system. It offers 8 GB RAM and 256 GB storage, which can be extended up to 1 TB. The price for the Acer Iconia Tab iM11 starts at ₹ 23,999.\r\n\r\nSamsung Galaxy Watch 8\r\n\r\nSamsung has launched the Galaxy Watch 8 and Galaxy Watch 8 Classic smartwatches, both of which run One UI 8 Watch with Gemini AI out of the box. The new model also features the Now Bar, while the iconic rotating bezel makes a comeback with the Watch 8 Classic. It has a 1.34-inch Super AMOLED display and can hold a 325 mAh battery. The Samsung Galaxy Watch 8 price starts at ₹ 32,999 and can go up to ₹ 46,999.\r\n\r\nVivo T4R 5G\r\n\r\nVivo has introduced its T4R series, which will reportedly run on the MediaTek Dimensity 7400 chipset. According to Gadgets 360, Vivo T4R is said to offer IP68 + IP69 ratings for dust and water resistance. The price for Vivo T4R 5G can range between ₹ 15,000 and ₹ 20,000.\r\n\r\nSamsung Galaxy Z Flip 7\r\n\r\nIt offers a 4.1-inch Super AMOLED Flex Window, which is the largest ever on a Galaxy Z Flip, and a 6.9-inch main display. It possesses 2,600 nits of peak brightness and a smooth 120 Hz refresh rate. It also has a 4,300 mAh battery, which is capable of delivering up to 31 hours of video playtime on a single charge. The Samsung Galaxy Z Flip 7 starts at ₹ 1,09,999.", "created_date": "2025-07-16T05:41:08Z", "published_date": null}}]